app/controllers/sessions_controller.rb

INSERT INTO "users" ("uid", "created_at", "updated_at") VALUES (?, ?, ?)  [["uid", 1], ["created_at", "2017-04-14 02:39:38.548512"], ["updated_at", "2017-04-14 02:39:38.548512"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1]]
---
  def create
    @user = User.find_or_create_by(uid: auth['uid']) do |u|